DOOM Emacs Config
#+PROPERTY: header-args :tangle /home/eklebanow/.doom.d/config.el
#+auto_tangle: t
* Email config using Mbsync and Mu4e
Mbsync is used to synchronize emails from outlook.com mail to be presented to Mu4e.  Outddgoing mail is gpg encoded. Bookmarks can be made and viewed and incoming e-mail can be sddent to graphical browsers for viewing.New emails will result in an emacs notification.

#+begin_src emacs-lisp
(setq mu4e-maildir (expand-file-name "~/Maildir/my-outlook/")
        mu4e-get-mail-command "mbsync -a"
        mu4e-update-interval 600
        mu4e-index-update-in-background t
        mu4e-compose-signature-auto-include t
        mu4e-use-fancy-chars t
        mu4e-view-show-addresses t
        mu4e-view-show-images t
        mu4e-compose-format-flowed t
        mu4e-change-filenames-when-moving t
        mu4e-maildir-shortcuts
         '( ("/Inbox" . ?i)
            ("/Archive" . ?a)
            ("/Drafts" . ?d)
            ("/Deleted" . ?t)
            ("/Sent" . ?s))

         message-send-mail-function 'sendmail-send-it
         sendmail-program "/usr/bin/msmtp"
         mail-specify-envelope-from t
         message-sendmail-envelope-from 'header
         mail-envelope-from 'header
         message-signature-file "~/.signature_email"
         message-citation-line-format "On %a %d %b %Y at %R, %f wrote:\n"
         message-citation-line-function 'message-insert-formatted-citation-line
         message-kill-buffer-on-exit t)

(set-email-account! "klebane@outlook.com"
                    '((user-mail-address      . "klebane@outlook.com")
                      (user-full-name         . "Edward Klebanow")
                      (smtpmail-smtp-server   . "smtp-mail.outlook.com")
                      (smtpmail-smtp-service  . 587)
                      (smtpmail-stream-type   . starttls)
                      (smtpmail-debug-info    . t)
                      (mu4e-drafts-folder     . "/Drafts")
                      (mu4e-refile-folder     . "/Archive")
                      (mu4e-sent-folder       . "/Sent")
                      (mu4e-trash-folder      . "/Deleted")
                      (mu4e-update-interval   . 600)
                      )
                    nil)

(global-set-key "\C-cm" 'mu4e)


(setq mu4e-get-mail-command (format "INSIDE_EMACS=%s mbsync -a" emacs-version)
      epa-pinentry-mode 'ask)
(setq mu4e-bookmarks
      `(
	("flag:unread AND NOT flag:trashed" "Unread messages" ?u)
	("flag:unread" "Unread messages" ?n)
        ("date:today..now" "Today's messages" ?t)
        ))
(map!
 :after mu4e
 :map mu4e-view-mode-map
 "C-c u" #'bjm/mu4e-view-go-to-url-gui)

  (after! mu4e
  (add-to-list 'mu4e-view-actions '("browse message" .  mu4e-action-view-in-browser)))

(defun bjm/mu4e-view-go-to-url-gui ()
  "Wrapper for mu4e-view-go-to-url to use gui browser instead of eww"
  (interactive)
  (let ((browse-url-browser-function . browse-url-qutebrowser-program))
    (mu4e-view-go-to-url-gui)))
(setq mu4e-headers-results-limit '50)
(setq bookmark-default-file '"/home/eklebanow/bookmarks")
(defun mu4e-headers-mark-all-unread-read ()
  "Put a ! \(read) mark on all visible unread messages."
  (interactive)
  (mu4e-headers-mark-for-each-if
   (cons 'read nil)
   (lambda (msg _param)
     (memq 'unread (mu4e-msg-field msg :flags)))))

(mu4e-alert-set-default-style 'libnotify)
(add-hook 'after-init-hook #'mu4e-alert-enable-notifications)

(add-hook 'mu4e-index-updated-hook
  (defun new-mail-sound ()
    (shell-command "aplay ~/sms.wav&")))
(setq alert-fade-time '10)
#+end_src

#+RESULTS:
| mu4e~headers-maybe-auto-update | mu4e-alert-notify-unread-mail-async | mu4e-alert-update-mail-count-modeline | new-mail-sound | mu4e~headers-index-updated-hook-fn |

* Setup for PDF exports
Here I use a setup file which is linked to each time a pdf is exported to get beautiful pdf exports.
#+begin_src emacs-lisp
(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("org-plain-latex"
               "\\documentclass{article}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
(setq org-latex-toc-command "\\tableofcontents \\clearpage")
#+end_src

#+RESULTS:
: \tableofcontents \clearpage

